import { TPost } from "./post.types"

export const post: TPost[] = [
  {
    title: 'В чем основная разница',
    description: 'Путаница между модальными глаголами can и may возникает из-за того, что на русский они оба могут переводиться как «могу», «можете» и т. д. На самом деле в английском между ними большая разница. Правила английского гласят, что can употребляется, когда подразумевается физическая возможность что-либо сделать, а may используется, когда речь идет о разрешении и позволении.'
  },
  {
    title: 'Историческая справка',
    description: 'Глагол can произошел от прагерманского слова kunnan, которое означало «быть в состоянии что-то сделать». Подразумеваются навыки и знания, благодаря которым человек способен совершать какие-либо действия. Глагол may тоже произошел от прагерманского слова — maganan, которое означало «иметь силу что-либо выполнять».'
  },
  {
    title: 'Когда можно сказать и can, и may',
    description: [
      'Но если бы все было так просто, в can и may никто бы не путался. В некоторых случаях, когда кажется, что употребить можно оба глагола, на помощь приходит контекст. May считается более формальным глаголом, который подходит для документов и делового общения, а can чаще можно услышать во время дружеских бесед.',
      '«May I have a glass of water?» — у вас пересохло в горле на собеседовании или на приеме у английской королевы, и вы просите дать попить с глаголом may. Все правильно, он для формальных вежливых просьб. Например, для просьбы «Можно выйти?» на уроке английского. «I can’t get up early» — вы физически не можете вставать рано. Это, во-первых, нормально, а во-вторых, про отсутствие (супер)способности. Поэтому снова can — с частицей not.',
      '«Can it be the truth?» («Разве это может быть правдой?»). Если вы удивлены чем-то так сильно, что не можете поверить, что это правда произошло, выразить эмоции вам поможет только глагол can. Никакого may здесь быть не может. Для выражения недоверия тоже нужен только глагол can. «He cannot swim across this lake» («Да не может он переплыть это озеро») — сомневаетесь вы в способностях друга. А если он все-таки это сделает, то возвращаемся к удивлению с тем же самым глаголом. В прошедшем времени can превращается в could. Это слово имеет те же самые значения, но только по отношению к прошлому.',
    ],
  },
  {
    title: 'Когда говорим только may',
    description: 'Когда речь о какой-то вероятности, возможном действии, то в этом случае наравне с may можно также использовать might, но будет незначительная разница в значении. Если в предложении есть might, то возможность представляется чуть менее вероятной. «Take an umbrella, it may rain tonight» — вы говорите кому-то, что нужно взять зонт, потому что вечером возможен дождь. О нем наверняка уже предупредили в прогнозе погоды. «The table is reserved, but there might be another option» — а тут вы отмечаете, что столик в ресторане или кафе уже заказан, однако, если что, возможен и другой вариант, но это вряд ли вам понадобится.'
  },
]