import postImage1 from 'assets/images/post1.jpg';
import postImage2 from 'assets/images/post2.jpg';
import postImage3 from 'assets/images/post3.jpg';

export const posts = [
  {
    img: postImage1,
    title: '6 культовых фраз из фильмов',
    description: 'Смотреть фильмы на английском — один из самых приятных способов выучить новую лексику. Причем не только отдельные слова, но и эпичные реплики, которые потом становятся крылатыми во всем мире. Мы собрали catchphrases — знаменитые фразы из кино.',
  },
  {
    img: postImage2,
    title: 'Как назвать время?',
    description: 'Октябрь в США — это не только Хэллоуин, но и National pizza month (национальный месяц пиццы). Вы еще успеваете съесть по этому поводу кусочек «Маргариты». А мы пока объясним о времени в английском все, чему вас не научили в школе.',
  },
  {
    img: postImage3,
    title: 'Что говорить в аэропорту?',
    description: 'В этом аэропорту случаются самые неожиданные ситуации и все общаются только по-английски. Самые нужные слова, чтобы получить заветное место в салоне и сдать багаж.',
  },
];